MikroElektronika/core_packages/PIC/XC8/def/PIC16F1526/mcu.h
extern volatile PIR1bits_t PIR1bits __at(0x011);
// bitfield macros
#define _PIR1_TMR1IF_POSN                                   0x0
#define _PIR1_TMR1IF_POSITION                               0x0
#define _PIR1_TMR1IF_SIZE                                   0x1
#define _PIR1_TMR1IF_LENGTH                                 0x1
#define _PIR1_TMR1IF_MASK                                   0x1
#define _PIR1_TMR2IF_POSN                                   0x1
#define _PIR1_TMR2IF_POSITION                               0x1
#define _PIR1_TMR2IF_SIZE                                   0x1
#define _PIR1_TMR2IF_LENGTH                                 0x1
#define _PIR1_TMR2IF_MASK                                   0x2
#define _PIR1_CCP1IF_POSN                                   0x2
#define _PIR1_CCP1IF_POSITION                               0x2
#define _PIR1_CCP1IF_SIZE                                   0x1
#define _PIR1_CCP1IF_LENGTH                                 0x1
#define _PIR1_CCP1IF_MASK                                   0x4
#define _PIR1_SSP1IF_POSN                                   0x3
#define _PIR1_SSP1IF_POSITION                               0x3
#define _PIR1_SSP1IF_SIZE                                   0x1
#define _PIR1_SSP1IF_LENGTH                                 0x1
#define _PIR1_SSP1IF_MASK                                   0x8
#define _PIR1_TX1IF_POSN                                    0x4
#define _PIR1_TX1IF_POSITION                                0x4
#define _PIR1_TX1IF_SIZE                                    0x1
#define _PIR1_TX1IF_LENGTH                                  0x1
#define _PIR1_TX1IF_MASK                                    0x10
#define _PIR1_RC1IF_POSN                                    0x5
#define _PIR1_RC1IF_POSITION                                0x5
#define _PIR1_RC1IF_SIZE                                    0x1
#define _PIR1_RC1IF_LENGTH                                  0x1
#define _PIR1_RC1IF_MASK                                    0x20
#define _PIR1_ADIF_POSN                                     0x6
#define _PIR1_ADIF_POSITION                                 0x6
#define _PIR1_ADIF_SIZE                                     0x1
#define _PIR1_ADIF_LENGTH                                   0x1
#define _PIR1_ADIF_MASK                                     0x40
#define _PIR1_TMR1GIF_POSN                                  0x7
#define _PIR1_TMR1GIF_POSITION                              0x7
#define _PIR1_TMR1GIF_SIZE                                  0x1
#define _PIR1_TMR1GIF_LENGTH                                0x1
#define _PIR1_TMR1GIF_MASK                                  0x80
#define _PIR1_SSPIF_POSN                                    0x3
#define _PIR1_SSPIF_POSITION                                0x3
#define _PIR1_SSPIF_SIZE                                    0x1
#define _PIR1_SSPIF_LENGTH                                  0x1
#define _PIR1_SSPIF_MASK                                    0x8
#define _PIR1_TXIF_POSN                                     0x4
#define _PIR1_TXIF_POSITION                                 0x4
#define _PIR1_TXIF_SIZE                                     0x1
#define _PIR1_TXIF_LENGTH                                   0x1
#define _PIR1_TXIF_MASK                                     0x10
#define _PIR1_RCIF_POSN                                     0x5
#define _PIR1_RCIF_POSITION                                 0x5
#define _PIR1_RCIF_SIZE                                     0x1
#define _PIR1_RCIF_LENGTH                                   0x1
#define _PIR1_RCIF_MASK                                     0x20

// Register: PIR2
#define PIR2 PIR2
extern volatile unsigned char           PIR2                __at(0x012);
#ifndef _LIB_BUILD
asm("PIR2 equ 012h");
#endif
// bitfield definitions
typedef union {
    struct {
        unsigned CCP2IF                 :1;
        unsigned TMR8IF                 :1;
        unsigned TMR10IF                :1;
        unsigned BCL1IF                 :1;
        unsigned                        :1;
        unsigned TMR3GIF                :1;
        unsigned TMR5GIF                :1;
        unsigned OSFIF                  :1;
    };
    struct {
        unsigned                        :3;
        unsigned BCLIF                  :1;
    };
} PIR2bits_t;
extern volatile PIR2bits_t PIR2bits __at(0x012);
// bitfield macros
#define _PIR2_CCP2IF_POSN                                   0x0
#define _PIR2_CCP2IF_POSITION                               0x0
#define _PIR2_CCP2IF_SIZE                                   0x1
#define _PIR2_CCP2IF_LENGTH                                 0x1
#define _PIR2_CCP2IF_MASK                                   0x1
#define _PIR2_TMR8IF_POSN                                   0x1
#define _PIR2_TMR8IF_POSITION                               0x1
#define _PIR2_TMR8IF_SIZE                                   0x1
#define _PIR2_TMR8IF_LENGTH                                 0x1
#define _PIR2_TMR8IF_MASK                                   0x2
#define _PIR2_TMR10IF_POSN                                  0x2
#define _PIR2_TMR10IF_POSITION                              0x2
#define _PIR2_TMR10IF_SIZE                                  0x1
#define _PIR2_TMR10IF_LENGTH                                0x1
#define _PIR2_TMR10IF_MASK                                  0x4
#define _PIR2_BCL1IF_POSN                                   0x3
#define _PIR2_BCL1IF_POSITION                               0x3
#define _PIR2_BCL1IF_SIZE                                   0x1
#define _PIR2_BCL1IF_LENGTH                                 0x1
#define _PIR2_BCL1IF_MASK                                   0x8
#define _PIR2_TMR3GIF_POSN                                  0x5
#define _PIR2_TMR3GIF_POSITION                              0x5
#define _PIR2_TMR3GIF_SIZE                                  0x1
#define _PIR2_TMR3GIF_LENGTH                                0x1
#define _PIR2_TMR3GIF_MASK                                  0x20
#define _PIR2_TMR5GIF_POSN                                  0x6
#define _PIR2_TMR5GIF_POSITION                              0x6
#define _PIR2_TMR5GIF_SIZE                                  0x1
#define _PIR2_TMR5GIF_LENGTH                                0x1
#define _PIR2_TMR5GIF_MASK                                  0x40
#define _PIR2_OSFIF_POSN                                    0x7
#define _PIR2_OSFIF_POSITION                                0x7
#define _PIR2_OSFIF_SIZE                                    0x1
#define _PIR2_OSFIF_LENGTH                                  0x1
#define _PIR2_OSFIF_MASK                                    0x80
#define _PIR2_BCLIF_POSN                                    0x3
#define _PIR2_BCLIF_POSITION                                0x3
#define _PIR2_BCLIF_SIZE                                    0x1
#define _PIR2_BCLIF_LENGTH                                  0x1
#define _PIR2_BCLIF_MASK                                    0x8

// Register: PIR3
#define PIR3 PIR3
extern volatile unsigned char           PIR3                __at(0x013);
#ifndef _LIB_BUILD
asm("PIR3 equ 013h");
#endif
// bitfield definitions
typedef union {
    struct {
        unsigned TMR3IF                 :1;
        unsigned TMR4IF                 :1;
        unsigned TMR5IF                 :1;
        unsigned TMR6IF                 :1;
        unsigned CCP3IF                 :1;
        unsigned CCP4IF                 :1;
        unsigned CCP5IF                 :1;
        unsigned CCP6IF                 :1;
    };
} PIR3bits_t;
extern volatile PIR3bits_t PIR3bits __at(0x013);
// bitfield macros
#define _PIR3_TMR3IF_POSN                                   0x0
#define _PIR3_TMR3IF_POSITION                               0x0
#define _PIR3_TMR3IF_SIZE                                   0x1
#define _PIR3_TMR3IF_LENGTH                                 0x1
#define _PIR3_TMR3IF_MASK                                   0x1
#define _PIR3_TMR4IF_POSN                                   0x1
#define _PIR3_TMR4IF_POSITION                               0x1
#define _PIR3_TMR4IF_SIZE                                   0x1
#define _PIR3_TMR4IF_LENGTH                                 0x1
#define _PIR3_TMR4IF_MASK                                   0x2
#define _PIR3_TMR5IF_POSN                                   0x2
#define _PIR3_TMR5IF_POSITION                               0x2
#define _PIR3_TMR5IF_SIZE                                   0x1
#define _PIR3_TMR5IF_LENGTH                                 0x1
#define _PIR3_TMR5IF_MASK                                   0x4
#define _PIR3_TMR6IF_POSN                                   0x3
#define _PIR3_TMR6IF_POSITION                               0x3
#define _PIR3_TMR6IF_SIZE                                   0x1
#define _PIR3_TMR6IF_LENGTH                                 0x1
#define _PIR3_TMR6IF_MASK                                   0x8
#define _PIR3_CCP3IF_POSN                                   0x4
#define _PIR3_CCP3IF_POSITION                               0x4
#define _PIR3_CCP3IF_SIZE                                   0x1
#define _PIR3_CCP3IF_LENGTH                                 0x1
#define _PIR3_CCP3IF_MASK                                   0x10
#define _PIR3_CCP4IF_POSN                                   0x5
#define _PIR3_CCP4IF_POSITION                               0x5
#define _PIR3_CCP4IF_SIZE                                   0x1
#define _PIR3_CCP4IF_LENGTH                                 0x1
#define _PIR3_CCP4IF_MASK                                   0x20
#define _PIR3_CCP5IF_POSN                                   0x6
#define _PIR3_CCP5IF_POSITION                               0x6
#define _PIR3_CCP5IF_SIZE                                   0x1
#define _PIR3_CCP5IF_LENGTH                                 0x1
#define _PIR3_CCP5IF_MASK                                   0x40
#define _PIR3_CCP6IF_POSN                                   0x7
#define _PIR3_CCP6IF_POSITION                               0x7
#define _PIR3_CCP6IF_SIZE                                   0x1
#define _PIR3_CCP6IF_LENGTH                                 0x1
#define _PIR3_CCP6IF_MASK                                   0x80

// Register: PIR4
#define PIR4 PIR4
extern volatile unsigned char           PIR4                __at(0x014);
#ifndef _LIB_BUILD
asm("PIR4 equ 014h");
#endif
// bitfield definitions
typedef union {
    struct {
        unsigned SSP2IF                 :1;
        unsigned BCL2IF                 :1;
        unsigned CCP7IF                 :1;
        unsigned CCP8IF                 :1;
        unsigned TX2IF                  :1;
        unsigned RC2IF                  :1;
        unsigned CCP9IF                 :1;
        unsigned CCP10IF                :1;
    };
} PIR4bits_t;
extern volatile PIR4bits_t PIR4bits __at(0x014);
// bitfield macros
#define _PIR4_SSP2IF_POSN                                   0x0
#define _PIR4_SSP2IF_POSITION                               0x0
#define _PIR4_SSP2IF_SIZE                                   0x1
#define _PIR4_SSP2IF_LENGTH                                 0x1
#define _PIR4_SSP2IF_MASK                                   0x1
#define _PIR4_BCL2IF_POSN                                   0x1
#define _PIR4_BCL2IF_POSITION                               0x1
#define _PIR4_BCL2IF_SIZE                                   0x1
#define _PIR4_BCL2IF_LENGTH                                 0x1
#define _PIR4_BCL2IF_MASK                                   0x2
#define _PIR4_CCP7IF_POSN                                   0x2
#define _PIR4_CCP7IF_POSITION                               0x2
#define _PIR4_CCP7IF_SIZE                                   0x1
#define _PIR4_CCP7IF_LENGTH                                 0x1
#define _PIR4_CCP7IF_MASK                                   0x4
#define _PIR4_CCP8IF_POSN                                   0x3
#define _PIR4_CCP8IF_POSITION                               0x3
#define _PIR4_CCP8IF_SIZE                                   0x1
#define _PIR4_CCP8IF_LENGTH                                 0x1
#define _PIR4_CCP8IF_MASK                                   0x8
#define _PIR4_TX2IF_POSN                                    0x4
#define _PIR4_TX2IF_POSITION                                0x4
#define _PIR4_TX2IF_SIZE                                    0x1
#define _PIR4_TX2IF_LENGTH                                  0x1
#define _PIR4_TX2IF_MASK                                    0x10
#define _PIR4_RC2IF_POSN                                    0x5
#define _PIR4_RC2IF_POSITION                                0x5
#define _PIR4_RC2IF_SIZE                                    0x1
#define _PIR4_RC2IF_LENGTH                                  0x1
#define _PIR4_RC2IF_MASK                                    0x20
#define _PIR4_CCP9IF_POSN                                   0x6
#define _PIR4_CCP9IF_POSITION                               0x6
#define _PIR4_CCP9IF_SIZE                                   0x1
#define _PIR4_CCP9IF_LENGTH                                 0x1
#define _PIR4_CCP9IF_MASK                                   0x40
#define _PIR4_CCP10IF_POSN                                  0x7
#define _PIR4_CCP10IF_POSITION                              0x7
#define _PIR4_CCP10IF_SIZE                                  0x1
#define _PIR4_CCP10IF_LENGTH                                0x1
#define _PIR4_CCP10IF_MASK                                  0x80

