MikroElektronika/core_packages/PIC/XC8/def/PIC16F1526/mcu.h
extern volatile CCPR2Lbits_t CCPR2Lbits __at(0x298);
// bitfield macros
#define _CCPR2L_CCPR2L_POSN                                 0x0
#define _CCPR2L_CCPR2L_POSITION                             0x0
#define _CCPR2L_CCPR2L_SIZE                                 0x8
#define _CCPR2L_CCPR2L_LENGTH                               0x8
#define _CCPR2L_CCPR2L_MASK                                 0xFF

// Register: CCPR2H
#define CCPR2H CCPR2H
extern volatile unsigned char           CCPR2H              __at(0x299);
#ifndef _LIB_BUILD
asm("CCPR2H equ 0299h");
#endif
// bitfield definitions
typedef union {
    struct {
        unsigned CCPR2H                 :8;
    };
} CCPR2Hbits_t;
extern volatile CCPR2Hbits_t CCPR2Hbits __at(0x299);
// bitfield macros
#define _CCPR2H_CCPR2H_POSN                                 0x0
#define _CCPR2H_CCPR2H_POSITION                             0x0
#define _CCPR2H_CCPR2H_SIZE                                 0x8
#define _CCPR2H_CCPR2H_LENGTH                               0x8
#define _CCPR2H_CCPR2H_MASK                                 0xFF

// Register: CCP2CON
#define CCP2CON CCP2CON
extern volatile unsigned char           CCP2CON             __at(0x29A);
#ifndef _LIB_BUILD
asm("CCP2CON equ 029Ah");
#endif
// bitfield definitions
typedef union {
    struct {
        unsigned CCP2M                  :4;
        unsigned DC2B                   :2;
    };
    struct {
        unsigned CCP2M0                 :1;
        unsigned CCP2M1                 :1;
        unsigned CCP2M2                 :1;
        unsigned CCP2M3                 :1;
        unsigned DC2B0                  :1;
        unsigned DC2B1                  :1;
    };
} CCP2CONbits_t;
extern volatile CCP2CONbits_t CCP2CONbits __at(0x29A);
// bitfield macros
#define _CCP2CON_CCP2M_POSN                                 0x0
#define _CCP2CON_CCP2M_POSITION                             0x0
#define _CCP2CON_CCP2M_SIZE                                 0x4
#define _CCP2CON_CCP2M_LENGTH                               0x4
#define _CCP2CON_CCP2M_MASK                                 0xF
#define _CCP2CON_DC2B_POSN                                  0x4
#define _CCP2CON_DC2B_POSITION                              0x4
#define _CCP2CON_DC2B_SIZE                                  0x2
#define _CCP2CON_DC2B_LENGTH                                0x2
#define _CCP2CON_DC2B_MASK                                  0x30
#define _CCP2CON_CCP2M0_POSN                                0x0
#define _CCP2CON_CCP2M0_POSITION                            0x0
#define _CCP2CON_CCP2M0_SIZE                                0x1
#define _CCP2CON_CCP2M0_LENGTH                              0x1
#define _CCP2CON_CCP2M0_MASK                                0x1
#define _CCP2CON_CCP2M1_POSN                                0x1
#define _CCP2CON_CCP2M1_POSITION                            0x1
#define _CCP2CON_CCP2M1_SIZE                                0x1
#define _CCP2CON_CCP2M1_LENGTH                              0x1
#define _CCP2CON_CCP2M1_MASK                                0x2
#define _CCP2CON_CCP2M2_POSN                                0x2
#define _CCP2CON_CCP2M2_POSITION                            0x2
#define _CCP2CON_CCP2M2_SIZE                                0x1
#define _CCP2CON_CCP2M2_LENGTH                              0x1
#define _CCP2CON_CCP2M2_MASK                                0x4
#define _CCP2CON_CCP2M3_POSN                                0x3
#define _CCP2CON_CCP2M3_POSITION                            0x3
#define _CCP2CON_CCP2M3_SIZE                                0x1
#define _CCP2CON_CCP2M3_LENGTH                              0x1
#define _CCP2CON_CCP2M3_MASK                                0x8
#define _CCP2CON_DC2B0_POSN                                 0x4
#define _CCP2CON_DC2B0_POSITION                             0x4
#define _CCP2CON_DC2B0_SIZE                                 0x1
#define _CCP2CON_DC2B0_LENGTH                               0x1
#define _CCP2CON_DC2B0_MASK                                 0x10
#define _CCP2CON_DC2B1_POSN                                 0x5
#define _CCP2CON_DC2B1_POSITION                             0x5
#define _CCP2CON_DC2B1_SIZE                                 0x1
#define _CCP2CON_DC2B1_LENGTH                               0x1
#define _CCP2CON_DC2B1_MASK                                 0x20

// Register: CCPTMRS0
#define CCPTMRS0 CCPTMRS0
extern volatile unsigned char           CCPTMRS0            __at(0x29D);
#ifndef _LIB_BUILD
asm("CCPTMRS0 equ 029Dh");
#endif
// bitfield definitions
typedef union {
    struct {
        unsigned C1TSEL                 :2;
        unsigned C2TSEL                 :2;
        unsigned C3TSEL                 :2;
        unsigned C4TSEL                 :2;
    };
    struct {
        unsigned C1TSEL0                :1;
        unsigned C1TSEL1                :1;
        unsigned C2TSEL0                :1;
        unsigned C2TSEL1                :1;
        unsigned C3TSEL0                :1;
        unsigned C3TSEL1                :1;
        unsigned C4TSEL0                :1;
        unsigned C4TSEL1                :1;
    };
} CCPTMRS0bits_t;
extern volatile CCPTMRS0bits_t CCPTMRS0bits __at(0x29D);
// bitfield macros
#define _CCPTMRS0_C1TSEL_POSN                               0x0
#define _CCPTMRS0_C1TSEL_POSITION                           0x0
#define _CCPTMRS0_C1TSEL_SIZE                               0x2
#define _CCPTMRS0_C1TSEL_LENGTH                             0x2
#define _CCPTMRS0_C1TSEL_MASK                               0x3
#define _CCPTMRS0_C2TSEL_POSN                               0x2
#define _CCPTMRS0_C2TSEL_POSITION                           0x2
#define _CCPTMRS0_C2TSEL_SIZE                               0x2
#define _CCPTMRS0_C2TSEL_LENGTH                             0x2
#define _CCPTMRS0_C2TSEL_MASK                               0xC
#define _CCPTMRS0_C3TSEL_POSN                               0x4
#define _CCPTMRS0_C3TSEL_POSITION                           0x4
#define _CCPTMRS0_C3TSEL_SIZE                               0x2
#define _CCPTMRS0_C3TSEL_LENGTH                             0x2
#define _CCPTMRS0_C3TSEL_MASK                               0x30
#define _CCPTMRS0_C4TSEL_POSN                               0x6
#define _CCPTMRS0_C4TSEL_POSITION                           0x6
#define _CCPTMRS0_C4TSEL_SIZE                               0x2
#define _CCPTMRS0_C4TSEL_LENGTH                             0x2
#define _CCPTMRS0_C4TSEL_MASK                               0xC0
#define _CCPTMRS0_C1TSEL0_POSN                              0x0
#define _CCPTMRS0_C1TSEL0_POSITION                          0x0
#define _CCPTMRS0_C1TSEL0_SIZE                              0x1
#define _CCPTMRS0_C1TSEL0_LENGTH                            0x1
#define _CCPTMRS0_C1TSEL0_MASK                              0x1
#define _CCPTMRS0_C1TSEL1_POSN                              0x1
#define _CCPTMRS0_C1TSEL1_POSITION                          0x1
#define _CCPTMRS0_C1TSEL1_SIZE                              0x1
#define _CCPTMRS0_C1TSEL1_LENGTH                            0x1
#define _CCPTMRS0_C1TSEL1_MASK                              0x2
#define _CCPTMRS0_C2TSEL0_POSN                              0x2
#define _CCPTMRS0_C2TSEL0_POSITION                          0x2
#define _CCPTMRS0_C2TSEL0_SIZE                              0x1
#define _CCPTMRS0_C2TSEL0_LENGTH                            0x1
#define _CCPTMRS0_C2TSEL0_MASK                              0x4
#define _CCPTMRS0_C2TSEL1_POSN                              0x3
#define _CCPTMRS0_C2TSEL1_POSITION                          0x3
#define _CCPTMRS0_C2TSEL1_SIZE                              0x1
#define _CCPTMRS0_C2TSEL1_LENGTH                            0x1
#define _CCPTMRS0_C2TSEL1_MASK                              0x8
#define _CCPTMRS0_C3TSEL0_POSN                              0x4
#define _CCPTMRS0_C3TSEL0_POSITION                          0x4
#define _CCPTMRS0_C3TSEL0_SIZE                              0x1
#define _CCPTMRS0_C3TSEL0_LENGTH                            0x1
#define _CCPTMRS0_C3TSEL0_MASK                              0x10
#define _CCPTMRS0_C3TSEL1_POSN                              0x5
#define _CCPTMRS0_C3TSEL1_POSITION                          0x5
#define _CCPTMRS0_C3TSEL1_SIZE                              0x1
#define _CCPTMRS0_C3TSEL1_LENGTH                            0x1
#define _CCPTMRS0_C3TSEL1_MASK                              0x20
#define _CCPTMRS0_C4TSEL0_POSN                              0x6
#define _CCPTMRS0_C4TSEL0_POSITION                          0x6
#define _CCPTMRS0_C4TSEL0_SIZE                              0x1
#define _CCPTMRS0_C4TSEL0_LENGTH                            0x1
#define _CCPTMRS0_C4TSEL0_MASK                              0x40
#define _CCPTMRS0_C4TSEL1_POSN                              0x7
#define _CCPTMRS0_C4TSEL1_POSITION                          0x7
#define _CCPTMRS0_C4TSEL1_SIZE                              0x1
#define _CCPTMRS0_C4TSEL1_LENGTH                            0x1
#define _CCPTMRS0_C4TSEL1_MASK                              0x80

// Register: CCPTMRS1
#define CCPTMRS1 CCPTMRS1
extern volatile unsigned char           CCPTMRS1            __at(0x29E);
#ifndef _LIB_BUILD
asm("CCPTMRS1 equ 029Eh");
#endif
// bitfield definitions
typedef union {
    struct {
        unsigned C5TSEL                 :2;
        unsigned C6TSEL                 :2;
        unsigned C7TSEL                 :2;
        unsigned C8TSEL                 :2;
    };
    struct {
        unsigned C5TSEL0                :1;
        unsigned C5TSEL1                :1;
        unsigned C6TSEL0                :1;
        unsigned C6TSEL1                :1;
        unsigned C7TSEL0                :1;
        unsigned C7TSEL1                :1;
        unsigned C8TSEL0                :1;
        unsigned C8TSEL1                :1;
    };
} CCPTMRS1bits_t;
extern volatile CCPTMRS1bits_t CCPTMRS1bits __at(0x29E);
// bitfield macros
#define _CCPTMRS1_C5TSEL_POSN                               0x0
#define _CCPTMRS1_C5TSEL_POSITION                           0x0
#define _CCPTMRS1_C5TSEL_SIZE                               0x2
#define _CCPTMRS1_C5TSEL_LENGTH                             0x2
#define _CCPTMRS1_C5TSEL_MASK                               0x3
#define _CCPTMRS1_C6TSEL_POSN                               0x2
#define _CCPTMRS1_C6TSEL_POSITION                           0x2
#define _CCPTMRS1_C6TSEL_SIZE                               0x2
#define _CCPTMRS1_C6TSEL_LENGTH                             0x2
#define _CCPTMRS1_C6TSEL_MASK                               0xC
#define _CCPTMRS1_C7TSEL_POSN                               0x4
#define _CCPTMRS1_C7TSEL_POSITION                           0x4
#define _CCPTMRS1_C7TSEL_SIZE                               0x2
#define _CCPTMRS1_C7TSEL_LENGTH                             0x2
#define _CCPTMRS1_C7TSEL_MASK                               0x30
#define _CCPTMRS1_C8TSEL_POSN                               0x6
#define _CCPTMRS1_C8TSEL_POSITION                           0x6
#define _CCPTMRS1_C8TSEL_SIZE                               0x2
#define _CCPTMRS1_C8TSEL_LENGTH                             0x2
#define _CCPTMRS1_C8TSEL_MASK                               0xC0
#define _CCPTMRS1_C5TSEL0_POSN                              0x0
#define _CCPTMRS1_C5TSEL0_POSITION                          0x0
#define _CCPTMRS1_C5TSEL0_SIZE                              0x1
#define _CCPTMRS1_C5TSEL0_LENGTH                            0x1
#define _CCPTMRS1_C5TSEL0_MASK                              0x1
#define _CCPTMRS1_C5TSEL1_POSN                              0x1
#define _CCPTMRS1_C5TSEL1_POSITION                          0x1
#define _CCPTMRS1_C5TSEL1_SIZE                              0x1
#define _CCPTMRS1_C5TSEL1_LENGTH                            0x1
#define _CCPTMRS1_C5TSEL1_MASK                              0x2
#define _CCPTMRS1_C6TSEL0_POSN                              0x2
#define _CCPTMRS1_C6TSEL0_POSITION                          0x2
#define _CCPTMRS1_C6TSEL0_SIZE                              0x1
#define _CCPTMRS1_C6TSEL0_LENGTH                            0x1
#define _CCPTMRS1_C6TSEL0_MASK                              0x4
#define _CCPTMRS1_C6TSEL1_POSN                              0x3
#define _CCPTMRS1_C6TSEL1_POSITION                          0x3
#define _CCPTMRS1_C6TSEL1_SIZE                              0x1
#define _CCPTMRS1_C6TSEL1_LENGTH                            0x1
#define _CCPTMRS1_C6TSEL1_MASK                              0x8
#define _CCPTMRS1_C7TSEL0_POSN                              0x4
#define _CCPTMRS1_C7TSEL0_POSITION                          0x4
#define _CCPTMRS1_C7TSEL0_SIZE                              0x1
#define _CCPTMRS1_C7TSEL0_LENGTH                            0x1
#define _CCPTMRS1_C7TSEL0_MASK                              0x10
#define _CCPTMRS1_C7TSEL1_POSN                              0x5
#define _CCPTMRS1_C7TSEL1_POSITION                          0x5
#define _CCPTMRS1_C7TSEL1_SIZE                              0x1
#define _CCPTMRS1_C7TSEL1_LENGTH                            0x1
#define _CCPTMRS1_C7TSEL1_MASK                              0x20
#define _CCPTMRS1_C8TSEL0_POSN                              0x6
#define _CCPTMRS1_C8TSEL0_POSITION                          0x6
#define _CCPTMRS1_C8TSEL0_SIZE                              0x1
#define _CCPTMRS1_C8TSEL0_LENGTH                            0x1
#define _CCPTMRS1_C8TSEL0_MASK                              0x40
#define _CCPTMRS1_C8TSEL1_POSN                              0x7
#define _CCPTMRS1_C8TSEL1_POSITION                          0x7
#define _CCPTMRS1_C8TSEL1_SIZE                              0x1
#define _CCPTMRS1_C8TSEL1_LENGTH                            0x1
#define _CCPTMRS1_C8TSEL1_MASK                              0x80

// Register: CCPTMRS2
#define CCPTMRS2 CCPTMRS2
extern volatile unsigned char           CCPTMRS2            __at(0x29F);
#ifndef _LIB_BUILD
asm("CCPTMRS2 equ 029Fh");
#endif
// bitfield definitions
typedef union {
    struct {
        unsigned C9TSEL                 :2;
        unsigned C10TSEL                :2;
    };
    struct {
        unsigned C9TSEL0                :1;
        unsigned C9TSEL1                :1;
        unsigned C10TSEL0               :1;
        unsigned C10TSEL1               :1;
    };
} CCPTMRS2bits_t;
extern volatile CCPTMRS2bits_t CCPTMRS2bits __at(0x29F);
// bitfield macros
#define _CCPTMRS2_C9TSEL_POSN                               0x0
#define _CCPTMRS2_C9TSEL_POSITION                           0x0
#define _CCPTMRS2_C9TSEL_SIZE                               0x2
#define _CCPTMRS2_C9TSEL_LENGTH                             0x2
#define _CCPTMRS2_C9TSEL_MASK                               0x3
#define _CCPTMRS2_C10TSEL_POSN                              0x2
#define _CCPTMRS2_C10TSEL_POSITION                          0x2
#define _CCPTMRS2_C10TSEL_SIZE                              0x2
#define _CCPTMRS2_C10TSEL_LENGTH                            0x2
#define _CCPTMRS2_C10TSEL_MASK                              0xC
#define _CCPTMRS2_C9TSEL0_POSN                              0x0
#define _CCPTMRS2_C9TSEL0_POSITION                          0x0
#define _CCPTMRS2_C9TSEL0_SIZE                              0x1
#define _CCPTMRS2_C9TSEL0_LENGTH                            0x1
#define _CCPTMRS2_C9TSEL0_MASK                              0x1
#define _CCPTMRS2_C9TSEL1_POSN                              0x1
#define _CCPTMRS2_C9TSEL1_POSITION                          0x1
#define _CCPTMRS2_C9TSEL1_SIZE                              0x1
#define _CCPTMRS2_C9TSEL1_LENGTH                            0x1
#define _CCPTMRS2_C9TSEL1_MASK                              0x2
#define _CCPTMRS2_C10TSEL0_POSN                             0x2
#define _CCPTMRS2_C10TSEL0_POSITION                         0x2
#define _CCPTMRS2_C10TSEL0_SIZE                             0x1
#define _CCPTMRS2_C10TSEL0_LENGTH                           0x1
#define _CCPTMRS2_C10TSEL0_MASK                             0x4
#define _CCPTMRS2_C10TSEL1_POSN                             0x3
#define _CCPTMRS2_C10TSEL1_POSITION                         0x3
#define _CCPTMRS2_C10TSEL1_SIZE                             0x1
#define _CCPTMRS2_C10TSEL1_LENGTH                           0x1
#define _CCPTMRS2_C10TSEL1_MASK                             0x8

