MikroElektronika/core_packages/PIC/XC8/def/PIC16F1526/mcu.h
extern volatile T8CONbits_t T8CONbits __at(0x597);
// bitfield macros
#define _T8CON_T8CKPS_POSN                                  0x0
#define _T8CON_T8CKPS_POSITION                              0x0
#define _T8CON_T8CKPS_SIZE                                  0x2
#define _T8CON_T8CKPS_LENGTH                                0x2
#define _T8CON_T8CKPS_MASK                                  0x3
#define _T8CON_TMR8ON_POSN                                  0x2
#define _T8CON_TMR8ON_POSITION                              0x2
#define _T8CON_TMR8ON_SIZE                                  0x1
#define _T8CON_TMR8ON_LENGTH                                0x1
#define _T8CON_TMR8ON_MASK                                  0x4
#define _T8CON_T8OUTPS_POSN                                 0x3
#define _T8CON_T8OUTPS_POSITION                             0x3
#define _T8CON_T8OUTPS_SIZE                                 0x4
#define _T8CON_T8OUTPS_LENGTH                               0x4
#define _T8CON_T8OUTPS_MASK                                 0x78
#define _T8CON_T8CKPS0_POSN                                 0x0
#define _T8CON_T8CKPS0_POSITION                             0x0
#define _T8CON_T8CKPS0_SIZE                                 0x1
#define _T8CON_T8CKPS0_LENGTH                               0x1
#define _T8CON_T8CKPS0_MASK                                 0x1
#define _T8CON_T8CKPS1_POSN                                 0x1
#define _T8CON_T8CKPS1_POSITION                             0x1
#define _T8CON_T8CKPS1_SIZE                                 0x1
#define _T8CON_T8CKPS1_LENGTH                               0x1
#define _T8CON_T8CKPS1_MASK                                 0x2
#define _T8CON_T8OUTPS0_POSN                                0x3
#define _T8CON_T8OUTPS0_POSITION                            0x3
#define _T8CON_T8OUTPS0_SIZE                                0x1
#define _T8CON_T8OUTPS0_LENGTH                              0x1
#define _T8CON_T8OUTPS0_MASK                                0x8
#define _T8CON_T8OUTPS1_POSN                                0x4
#define _T8CON_T8OUTPS1_POSITION                            0x4
#define _T8CON_T8OUTPS1_SIZE                                0x1
#define _T8CON_T8OUTPS1_LENGTH                              0x1
#define _T8CON_T8OUTPS1_MASK                                0x10
#define _T8CON_T8OUTPS2_POSN                                0x5
#define _T8CON_T8OUTPS2_POSITION                            0x5
#define _T8CON_T8OUTPS2_SIZE                                0x1
#define _T8CON_T8OUTPS2_LENGTH                              0x1
#define _T8CON_T8OUTPS2_MASK                                0x20
#define _T8CON_T8OUTPS3_POSN                                0x6
#define _T8CON_T8OUTPS3_POSITION                            0x6
#define _T8CON_T8OUTPS3_SIZE                                0x1
#define _T8CON_T8OUTPS3_LENGTH                              0x1
#define _T8CON_T8OUTPS3_MASK                                0x40

// Register: TMR10
#define TMR10 TMR10
extern volatile unsigned char           TMR10               __at(0x59C);
#ifndef _LIB_BUILD
asm("TMR10 equ 059Ch");
#endif
// bitfield definitions
typedef union {
    struct {
        unsigned TMR10                  :8;
    };
} TMR10bits_t;
extern volatile TMR10bits_t TMR10bits __at(0x59C);
// bitfield macros
#define _TMR10_TMR10_POSN                                   0x0
#define _TMR10_TMR10_POSITION                               0x0
#define _TMR10_TMR10_SIZE                                   0x8
#define _TMR10_TMR10_LENGTH                                 0x8
#define _TMR10_TMR10_MASK                                   0xFF

// Register: PR10
#define PR10 PR10
extern volatile unsigned char           PR10                __at(0x59D);
#ifndef _LIB_BUILD
asm("PR10 equ 059Dh");
#endif
// bitfield definitions
typedef union {
    struct {
        unsigned PR10                   :8;
    };
} PR10bits_t;
extern volatile PR10bits_t PR10bits __at(0x59D);
// bitfield macros
#define _PR10_PR10_POSN                                     0x0
#define _PR10_PR10_POSITION                                 0x0
#define _PR10_PR10_SIZE                                     0x8
#define _PR10_PR10_LENGTH                                   0x8
#define _PR10_PR10_MASK                                     0xFF

// Register: T10CON
#define T10CON T10CON
extern volatile unsigned char           T10CON              __at(0x59E);
#ifndef _LIB_BUILD
asm("T10CON equ 059Eh");
#endif
// bitfield definitions
typedef union {
    struct {
        unsigned T10CKPS                :2;
        unsigned TMR10ON                :1;
        unsigned T10OUTPS               :4;
    };
    struct {
        unsigned T10CKPS0               :1;
        unsigned T10CKPS1               :1;
        unsigned                        :1;
        unsigned T10OUTPS0              :1;
        unsigned T10OUTPS1              :1;
        unsigned T10OUTPS2              :1;
        unsigned T10OUTPS3              :1;
    };
} T10CONbits_t;
extern volatile T10CONbits_t T10CONbits __at(0x59E);
// bitfield macros
#define _T10CON_T10CKPS_POSN                                0x0
#define _T10CON_T10CKPS_POSITION                            0x0
#define _T10CON_T10CKPS_SIZE                                0x2
#define _T10CON_T10CKPS_LENGTH                              0x2
#define _T10CON_T10CKPS_MASK                                0x3
#define _T10CON_TMR10ON_POSN                                0x2
#define _T10CON_TMR10ON_POSITION                            0x2
#define _T10CON_TMR10ON_SIZE                                0x1
#define _T10CON_TMR10ON_LENGTH                              0x1
#define _T10CON_TMR10ON_MASK                                0x4
#define _T10CON_T10OUTPS_POSN                               0x3
#define _T10CON_T10OUTPS_POSITION                           0x3
#define _T10CON_T10OUTPS_SIZE                               0x4
#define _T10CON_T10OUTPS_LENGTH                             0x4
#define _T10CON_T10OUTPS_MASK                               0x78
#define _T10CON_T10CKPS0_POSN                               0x0
#define _T10CON_T10CKPS0_POSITION                           0x0
#define _T10CON_T10CKPS0_SIZE                               0x1
#define _T10CON_T10CKPS0_LENGTH                             0x1
#define _T10CON_T10CKPS0_MASK                               0x1
#define _T10CON_T10CKPS1_POSN                               0x1
#define _T10CON_T10CKPS1_POSITION                           0x1
#define _T10CON_T10CKPS1_SIZE                               0x1
#define _T10CON_T10CKPS1_LENGTH                             0x1
#define _T10CON_T10CKPS1_MASK                               0x2
#define _T10CON_T10OUTPS0_POSN                              0x3
#define _T10CON_T10OUTPS0_POSITION                          0x3
#define _T10CON_T10OUTPS0_SIZE                              0x1
#define _T10CON_T10OUTPS0_LENGTH                            0x1
#define _T10CON_T10OUTPS0_MASK                              0x8
#define _T10CON_T10OUTPS1_POSN                              0x4
#define _T10CON_T10OUTPS1_POSITION                          0x4
#define _T10CON_T10OUTPS1_SIZE                              0x1
#define _T10CON_T10OUTPS1_LENGTH                            0x1
#define _T10CON_T10OUTPS1_MASK                              0x10
#define _T10CON_T10OUTPS2_POSN                              0x5
#define _T10CON_T10OUTPS2_POSITION                          0x5
#define _T10CON_T10OUTPS2_SIZE                              0x1
#define _T10CON_T10OUTPS2_LENGTH                            0x1
#define _T10CON_T10OUTPS2_MASK                              0x20
#define _T10CON_T10OUTPS3_POSN                              0x6
#define _T10CON_T10OUTPS3_POSITION                          0x6
#define _T10CON_T10OUTPS3_SIZE                              0x1
#define _T10CON_T10OUTPS3_LENGTH                            0x1
#define _T10CON_T10OUTPS3_MASK                              0x40

// Register: CCPR6
#define CCPR6 CCPR6
extern volatile unsigned short          CCPR6               __at(0x611);
#ifndef _LIB_BUILD
asm("CCPR6 equ 0611h");
#endif

// Register: CCPR6L
#define CCPR6L CCPR6L
extern volatile unsigned char           CCPR6L              __at(0x611);
#ifndef _LIB_BUILD
asm("CCPR6L equ 0611h");
#endif
// bitfield definitions
typedef union {
    struct {
        unsigned CCPR6L                 :8;
    };
} CCPR6Lbits_t;
